node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2803
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 2803
          }
        }
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed0.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed1.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed10.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed100.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed101.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed102.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed103.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed104.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed105.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed106.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed107.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed108.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed109.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed11.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed110.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed111.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed112.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed113.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed114.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed115.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed116.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed117.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed118.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed119.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed12.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed120.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed121.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed122.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed123.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed124.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed125.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed126.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed127.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed128.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed129.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed13.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed130.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed131.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed132.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed133.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed134.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed135.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed136.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed137.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed138.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed139.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed14.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed140.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed141.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed142.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed143.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed144.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed145.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed146.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed147.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed148.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed149.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed15.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed150.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed151.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed152.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed153.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed154.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed155.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed156.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed157.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed158.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed159.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed16.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed160.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed161.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed162.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed163.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed164.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed165.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed166.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed167.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed168.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed169.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed17.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed170.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed171.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed172.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed173.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed174.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed175.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed176.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed177.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed178.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed179.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed18.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed180.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed181.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed182.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed183.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed184.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed185.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed186.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed187.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed188.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed189.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed19.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed190.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed191.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed192.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed193.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed194.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed195.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed196.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed197.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed198.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed199.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed2.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed20.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed200.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed201.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed202.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed203.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed204.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed205.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed206.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed207.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed208.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed209.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed21.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed210.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed211.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed212.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed213.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed214.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed215.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed216.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed217.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed218.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed219.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed22.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed220.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed221.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed222.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed223.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed224.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed225.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed226.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed227.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed228.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed229.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed23.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed230.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed231.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed232.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed233.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed234.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed235.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed236.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed237.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed238.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed239.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed24.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed240.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed241.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed242.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed243.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed244.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed245.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed246.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed247.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed248.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed249.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed25.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed250.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed251.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed252.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed253.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed254.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed255.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed256.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed257.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed258.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed259.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed26.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed260.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed261.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed262.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed263.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed264.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed265.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed266.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed267.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed268.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed269.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed27.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed270.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed271.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed272.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed273.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed274.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed275.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed276.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed277.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed278.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed279.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed28.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed280.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed281.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed282.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed283.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed284.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed285.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed286.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed287.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed288.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed289.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed29.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed290.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed291.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed292.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed293.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed294.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed295.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed296.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed297.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed298.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed299.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed3.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed30.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed300.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed301.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed302.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed303.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed304.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed305.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed306.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed307.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed308.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed309.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed31.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed310.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed311.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed312.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed313.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed314.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed315.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed316.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed317.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed318.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed319.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed32.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed320.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed321.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed322.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed323.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed324.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed325.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed326.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed327.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed328.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed329.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed33.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed330.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed331.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed332.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed333.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed334.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed335.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed336.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed337.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed338.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed339.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed34.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed340.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed341.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed342.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed343.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed344.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed345.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed346.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed347.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed348.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed349.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed35.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed350.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed351.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed352.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed353.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed354.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed355.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed356.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed357.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed358.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed359.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed36.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed360.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed361.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed362.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed363.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed364.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed365.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed366.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed367.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed368.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed37.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed370.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed371.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed372.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed373.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed374.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed375.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed376.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed377.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed378.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed379.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed38.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed380.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed381.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed382.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed384.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed385.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed386.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed387.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed388.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed389.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed39.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed390.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed391.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed392.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed393.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed394.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed395.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed396.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed397.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed398.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed399.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed4.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed40.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed400.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed401.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed402.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed403.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed404.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed405.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed406.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed407.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed408.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed409.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed41.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed410.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed411.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed412.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed413.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed414.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed415.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed416.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed417.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed418.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed419.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed42.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed420.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed421.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed422.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed423.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed424.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed425.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed426.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed427.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed428.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed429.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed43.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed430.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed431.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed432.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed433.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed434.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed435.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed436.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed437.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed438.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed439.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed44.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed440.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed441.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed442.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed443.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed444.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed445.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed446.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed447.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed448.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed449.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed45.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed450.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed451.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed452.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed46.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed47.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed48.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed49.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed5.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed50.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed51.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed52.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed53.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed54.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed55.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed56.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed57.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed58.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed59.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed6.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed60.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed61.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed62.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed63.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed64.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed65.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed66.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed67.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed68.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed69.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed7.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed70.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed71.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed72.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed73.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed74.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed75.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed76.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed77.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed78.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed79.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed8.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed80.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed81.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed82.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed83.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed84.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed85.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed86.jpg"
        string_val: "D:\\TensorFlowDev\\PythonWorksp\\TensorFlow\\furniture\\bed\\baby-bed\\baby-bed87.jpg"
